In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('salaries.csv')

In [3]:
data.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:
comp=LabelEncoder()

In [6]:
j=LabelEncoder()

In [7]:
d=LabelEncoder()

In [8]:
data.company=comp.fit_transform(data.company)
data.job=j.fit_transform(data.job)
data.degree=d.fit_transform(data.degree)

In [9]:
data.head()

   company  job  degree  salary_more_then_100k
0        2    2       0                      0
1        2    2       1                      0
2        2    0       0                      1
3        2    0       1                      1
4        2    1       0                      0

In [10]:
target=data['salary_more_then_100k']

In [11]:
data=data.drop('salary_more_then_100k',axis='columns')

In [14]:
data.head()

   company  job  degree
0        2    2       0
1        2    2       1
2        2    0       0
3        2    0       1
4        2    1       0

In [18]:
from sklearn import tree

In [19]:
tre=tree.DecisionTreeClassifier()

In [20]:
tre.fit(data,target)

DecisionTreeClassifier()

In [21]:
tre.predict([[2,0,1]])

array([1])

In [23]:
tre.score(data,target)

1.0